Delans-TLE/src/InformationRegisters/ЖурналСинхронизацииМП/ЖурналСинхронизацииМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСинхронизацииМП</name>
  <resources>
    <name>ФормированиеПакетовНаКлиенте</name>
    <type>
      <types>EnumRef.СтатусыФормированияПакетовМП</types>
    </type>
  </resources>
  <resources>
    <name>ФормированиеПакетовНаСервере</name>
    <type>
      <types>EnumRef.СтатусыФормированияПакетовМП</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияБазыСКоторойИдетОбмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторФоновогоЗаданияНаСервере</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <attributes>
    <name>СтатусСинхронизации</name>
    <type>
      <types>EnumRef.СтатусыСинхронизацииМП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.СинхронизацияМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИВремяПоследнейСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ЖурналСинхронизацииМП/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИнформацию(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Структура.Узел);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапсиь = НаборЗаписей.Добавить();
		Для Каждого Элемент Из Структура Цикл
			НоваяЗапсиь[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		
	Иначе
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			Для Каждого Элемент Из Структура Цикл
				ЗаписьНабора[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьФормированиеПакетовНаКлиенте(КодУзла) Экспорт 
	
	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду(КодУзла);
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		ФормированиеПакетовНаКлиенте = ЗаписьНабора.ФормированиеПакетовНаКлиенте; 
	КонецЦикла;
	
	Возврат ФормированиеПакетовНаКлиенте

КонецФункции

Функция ПолучитьФормированиеПакетовНаСервере(КодУзла) Экспорт 
	
	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду(КодУзла);
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		ФормированиеПакетовНаСервере = ЗаписьНабора.ФормированиеПакетовНаСервере; 
	КонецЦикла;
	
	Возврат ФормированиеПакетовНаСервере

КонецФункции 

Функция ПолучитьВерсиюБазыСКоторойИдетСинхронизация(КодУзла) Экспорт 
	
	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду(КодУзла);
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		ВерсияБазыСКоторойИдетОбмен = ЗаписьНабора.ВерсияБазыСКоторойИдетОбмен; 
	КонецЦикла;
	
	Возврат ВерсияБазыСКоторойИдетОбмен

КонецФункции

Функция ПолучитьФоновоеЗаданиеНаСервереЗавершено(КодУзла) Экспорт 
	
	//Узел = ПланыОбмена.Синхронизация.НайтиПоКоду(КодУзла);
	//
	//НаборЗаписей = РегистрыСведений.ЖурналСинхронизации.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Узел.Установить(Узел);
	//НаборЗаписей.Прочитать();
	//
	//Для каждого ЗаписьНабора Из НаборЗаписей Цикл
	//	//ФоновоеЗаданиеНаСервереЗавершено = ЗаписьНабора.ФоновоеЗаданиеНаСервереЗавершено; 
	//КонецЦикла;
	//
	//Возврат ФоновоеЗаданиеНаСервереЗавершено

КонецФункции 

Функция ПолучитьИдентификаторФоновогоЗадания(КодУзла) Экспорт
	
	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду(КодУзла);
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		ИдентификаторФоновогоЗаданияНаСервере = ЗаписьНабора.ИдентификаторФоновогоЗаданияНаСервере;
	КонецЦикла;
	
	Возврат ИдентификаторФоновогоЗаданияНаСервере
	
КонецФункции // ()

Функция ПолучитьСтатусСинхронизации() Экспорт

	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду("001");
	
	НаборЗаписей = РегистрыСведений.ЖурналСинхронизацииМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		СтатусСинхронизации = ЗаписьНабора.СтатусСинхронизации;
	КонецЦикла;
	
	Возврат СтатусСинхронизации
	
КонецФункции
 
#КонецОбласти
